qa/ab-result

This is ApacheBench, Version 2.3 <$Revision: 655654 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)...INFO: POST header == 
---
GET / HTTP/1.0
Host: localhost:8888
User-Agent: ApacheBench/2.3
Accept: */*


---
LOG: header received:
HTTP/1.1 200
Content-Length: 11
Last-Modified: Sun, 17 Nov 2013 07:39:12 GMT
Connection: Keep-Alive

hello world
LOG: Response code = 200
..done


Server Software:        
Server Hostname:        localhost
Server Port:            8888

Document Path:          /
Document Length:        11 bytes

Concurrency Level:      1
Time taken for tests:   0.002 seconds
Complete requests:      1
Failed requests:        0
Write errors:           0
Total transferred:      117 bytes
HTML transferred:       11 bytes
Requests per second:    603.50 [#/sec] (mean)
Time per request:       1.657 [ms] (mean)
Time per request:       1.657 [ms] (mean, across all concurrent requests)
Transfer rate:          68.95 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        1    1   0.0      1       1
Processing:     1    1   0.0      1       1
Waiting:        0    0   0.0      0       0
Total:          2    2   0.0      2       2
This is ApacheBench, Version 2.3 <$Revision: 655654 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)...INFO: POST header == 
---
GET / HTTP/1.0
Connection: Keep-Alive
Host: localhost:8888
User-Agent: ApacheBench/2.3
Accept: */*


---
LOG: header received:
HTTP/1.1 200
Content-Length: 11
Last-Modified: Sun, 17 Nov 2013 07:39:12 GMT
Connection: Keep-Alive

hello world
LOG: Response code = 200
..done


Server Software:        
Server Hostname:        localhost
Server Port:            8888

Document Path:          /
Document Length:        11 bytes

Concurrency Level:      1
Time taken for tests:   0.001 seconds
Complete requests:      1
Failed requests:        0
Write errors:           0
Keep-Alive requests:    1
Total transferred:      117 bytes
HTML transferred:       11 bytes
Requests per second:    1428.57 [#/sec] (mean)
Time per request:       0.700 [ms] (mean)
Time per request:       0.700 [ms] (mean, across all concurrent requests)
Transfer rate:          163.23 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.0      0       0
Processing:     0    0   0.0      0       0
Waiting:        0    0   0.0      0       0
Total:          1    1   0.0      1       1
This is ApacheBench, Version 2.3 <$Revision: 655654 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        
Server Hostname:        localhost
Server Port:            8888

Document Path:          /
Document Length:        11 bytes

Concurrency Level:      1
Time taken for tests:   3.139 seconds
Complete requests:      10000
Failed requests:        0
Write errors:           0
Total transferred:      1170000 bytes
HTML transferred:       110000 bytes
Requests per second:    3185.27 [#/sec] (mean)
Time per request:       0.314 [ms] (mean)
Time per request:       0.314 [ms] (mean, across all concurrent requests)
Transfer rate:          363.94 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.1      0       6
Processing:     0    0   0.6      0      19
Waiting:        0    0   0.5      0      12
Total:          0    0   0.6      0      20

Percentage of the requests served within a certain time (ms)
  50%      0
  66%      0
  75%      0
  80%      0
  90%      0
  95%      0
  98%      1
  99%      3
 100%     20 (longest request)
This is ApacheBench, Version 2.3 <$Revision: 655654 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        
Server Hostname:        localhost
Server Port:            8888

Document Path:          /
Document Length:        11 bytes

Concurrency Level:      1
Time taken for tests:   1.341 seconds
Complete requests:      10000
Failed requests:        0
Write errors:           0
Keep-Alive requests:    10000
Total transferred:      1170000 bytes
HTML transferred:       110000 bytes
Requests per second:    7459.27 [#/sec] (mean)
Time per request:       0.134 [ms] (mean)
Time per request:       0.134 [ms] (mean, across all concurrent requests)
Transfer rate:          852.28 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.0      0       0
Processing:     0    0   0.6      0      20
Waiting:        0    0   0.6      0      20
Total:          0    0   0.6      0      20

Percentage of the requests served within a certain time (ms)
  50%      0
  66%      0
  75%      0
  80%      0
  90%      0
  95%      0
  98%      1
  99%      2
 100%     20 (longest request)
This is ApacheBench, Version 2.3 <$Revision: 655654 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        
Server Hostname:        localhost
Server Port:            8888

Document Path:          /
Document Length:        11 bytes

Concurrency Level:      100
Time taken for tests:   1.723 seconds
Complete requests:      10000
Failed requests:        0
Write errors:           0
Total transferred:      1170000 bytes
HTML transferred:       110000 bytes
Requests per second:    5802.30 [#/sec] (mean)
Time per request:       17.235 [ms] (mean)
Time per request:       0.172 [ms] (mean, across all concurrent requests)
Transfer rate:          662.96 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    5   4.7      3      36
Processing:     2   12   6.2     11      42
Waiting:        1   10   6.1      8      36
Total:          5   17   7.6     16      51

Percentage of the requests served within a certain time (ms)
  50%     16
  66%     18
  75%     20
  80%     22
  90%     25
  95%     30
  98%     42
  99%     47
 100%     51 (longest request)
This is ApacheBench, Version 2.3 <$Revision: 655654 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        
Server Hostname:        localhost
Server Port:            8888

Document Path:          /
Document Length:        11 bytes

Concurrency Level:      100
Time taken for tests:   0.634 seconds
Complete requests:      10000
Failed requests:        0
Write errors:           0
Keep-Alive requests:    10000
Total transferred:      1170000 bytes
HTML transferred:       110000 bytes
Requests per second:    15782.98 [#/sec] (mean)
Time per request:       6.336 [ms] (mean)
Time per request:       0.063 [ms] (mean, across all concurrent requests)
Transfer rate:          1803.33 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.6      0       6
Processing:     1    6   2.7      6      20
Waiting:        1    6   2.7      6      20
Total:          1    6   2.8      6      20

Percentage of the requests served within a certain time (ms)
  50%      6
  66%      7
  75%      8
  80%      8
  90%     10
  95%     12
  98%     13
  99%     17
 100%     20 (longest request)
This is ApacheBench, Version 2.3 <$Revision: 655654 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)...INFO: POST header == 
---
GET /qa/t001.txt HTTP/1.0
Host: localhost:8888
User-Agent: ApacheBench/2.3
Accept: */*


---
LOG: header received:
HTTP/1.1 200
Content-Length: 131601
Last-Modified: Thu, 07 Nov 2013 06:29:59 GMT
Accept-Ranges: bytes

package htp;

import java.nio.channels.SelectionKey;
import java.util.ArrayList;

final class thd_req extends Thread {
	static ArrayList<thd_req>all=new ArrayList<thd_req>(cfg.htp_reqthreads);
	req r;
	private static int seq;
	thd_req(){
		super("t"+utl.pad(Integer.toString(seq++),2,'0',"",true));
		all.add(this);
	}
	public void run(){
		try{
			while(true){
				r=null;
				synchronized(htp.server.pending_req){
					thd_watch.thdsfree++;
					while(htp.server.pending_req.isEmpty())
						htp.server.pending_req.wait();
					r=htp.server.pending_req.removeFirst();
					thd_watch.thdsfree--;
				}
				try{
					if(r.is_waiting_for_free_thread())
						r.run_page();
					else if(r.is_waiting_for_free_thread_content_proc())
						r.run_page_content();
					else
						throw new IllegalStateException();
					if(r.selectionKey.isValid()){
						if(r.is_transfer())
							r.selectionKey.interestOps(SelectionKey.OP_WRITE);
						else
							r.selectionKey.interestOps(SelectionKey.OP_READ);
						if(!r.is_connection_keep_alive()&&r.is_state_method()){
							r.close_socketChannel();
							continue;
						}
						r.selectionKey.selector().wakeup();
					}
				}catch(Throwable e){
					r.close_socketChannel();
					String msg=e.getMessage();
					if("Broken pipe".equals(msg)){
					}else if("Connection reset by peer".equals(msg)){
					}else if(e instanceof ClassNotFoundException){
					}else htp.log(e);
				}
			}
		}catch(Throwable t){
			thd_watch._thderr++;
			t.printStackTrace();
		}
	}
}
package htp;

import java.io.FileInputStream;
import java.io.IOException;
import java.io.OutputStream;
import java.net.URLDecoder;
import java.nio.ByteBuffer;
import java.nio.channels.ClosedChannelException;
import java.nio.channels.FileChannel;
import java.nio.channels.IllegalSelectorException;
import java.nio.channels.SelectionKey;
import java.nio.channels.SocketChannel;
import java.text.SimpleDateFormat;
import java.util.Dat
LOG: Response code = 200
..done


Server Software:        
Server Hostname:        localhost
Server Port:            8888

Document Path:          /qa/t001.txt
Document Length:        131601 bytes

Concurrency Level:      1
Time taken for tests:   0.003 seconds
Complete requests:      1
Failed requests:        0
Write errors:           0
Total transferred:      131709 bytes
HTML transferred:       131601 bytes
Requests per second:    321.34 [#/sec] (mean)
Time per request:       3.112 [ms] (mean)
Time per request:       3.112 [ms] (mean, across all concurrent requests)
Transfer rate:          41331.00 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.0      0       0
Processing:     3    3   0.0      3       3
Waiting:        0    0   0.0      0       0
Total:          3    3   0.0      3       3
This is ApacheBench, Version 2.3 <$Revision: 655654 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)...INFO: POST header == 
---
GET /qa/t001.txt HTTP/1.0
Connection: Keep-Alive
Host: localhost:8888
User-Agent: ApacheBench/2.3
Accept: */*


---
LOG: header received:
HTTP/1.1 200
Content-Length: 131601
Last-Modified: Thu, 07 Nov 2013 06:29:59 GMT
Accept-Ranges: bytes
Connection: Keep-Alive

package htp;

import java.nio.channels.SelectionKey;
import java.util.ArrayList;

final class thd_req extends Thread {
	static ArrayList<thd_req>all=new ArrayList<thd_req>(cfg.htp_reqthreads);
	req r;
	private static int seq;
	thd_req(){
		super("t"+utl.pad(Integer.toString(seq++),2,'0',"",true));
		all.add(this);
	}
	public void run(){
		try{
			while(true){
				r=null;
				synchronized(htp.server.pending_req){
					thd_watch.thdsfree++;
					while(htp.server.pending_req.isEmpty())
						htp.server.pending_req.wait();
					r=htp.server.pending_req.removeFirst();
					thd_watch.thdsfree--;
				}
				try{
					if(r.is_waiting_for_free_thread())
						r.run_page();
					else if(r.is_waiting_for_free_thread_content_proc())
						r.run_page_content();
					else
						throw new IllegalStateException();
					if(r.selectionKey.isValid()){
						if(r.is_transfer())
							r.selectionKey.interestOps(SelectionKey.OP_WRITE);
						else
							r.selectionKey.interestOps(SelectionKey.OP_READ);
						if(!r.is_connection_keep_alive()&&r.is_state_method()){
							r.close_socketChannel();
							continue;
						}
						r.selectionKey.selector().wakeup();
					}
				}catch(Throwable e){
					r.close_socketChannel();
					String msg=e.getMessage();
					if("Broken pipe".equals(msg)){
					}else if("Connection reset by peer".equals(msg)){
					}else if(e instanceof ClassNotFoundException){
					}else htp.log(e);
				}
			}
		}catch(Throwable t){
			thd_watch._thderr++;
			t.printStackTrace();
		}
	}
}
package htp;

import java.io.FileInputStream;
import java.io.IOException;
import java.io.OutputStream;
import java.net.URLDecoder;
import java.nio.ByteBuffer;
import java.nio.channels.ClosedChannelException;
import java.nio.channels.FileChannel;
import java.nio.channels.IllegalSelectorException;
import java.nio.channels.SelectionKey;
import java.nio.channels.SocketChannel;
import java.text.SimpleDateForm
LOG: Response code = 200
..done


Server Software:        
Server Hostname:        localhost
Server Port:            8888

Document Path:          /qa/t001.txt
Document Length:        131601 bytes

Concurrency Level:      1
Time taken for tests:   0.001 seconds
Complete requests:      1
Failed requests:        0
Write errors:           0
Keep-Alive requests:    1
Total transferred:      131733 bytes
HTML transferred:       131601 bytes
Requests per second:    768.05 [#/sec] (mean)
Time per request:       1.302 [ms] (mean)
Time per request:       1.302 [ms] (mean, across all concurrent requests)
Transfer rate:          98806.07 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.0      0       0
Processing:     1    1   0.0      1       1
Waiting:        0    0   0.0      0       0
Total:          1    1   0.0      1       1
This is ApacheBench, Version 2.3 <$Revision: 655654 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        
Server Hostname:        localhost
Server Port:            8888

Document Path:          /qa/t001.txt
Document Length:        131601 bytes

Concurrency Level:      1
Time taken for tests:   3.679 seconds
Complete requests:      5000
Failed requests:        0
Write errors:           0
Total transferred:      658545000 bytes
HTML transferred:       658005000 bytes
Requests per second:    1358.99 [#/sec] (mean)
Time per request:       0.736 [ms] (mean)
Time per request:       0.736 [ms] (mean, across all concurrent requests)
Transfer rate:          174796.29 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.1      0       5
Processing:     0    1   3.0      0     201
Waiting:        0    0   0.8      0      26
Total:          0    1   3.0      0     201

Percentage of the requests served within a certain time (ms)
  50%      0
  66%      1
  75%      1
  80%      1
  90%      1
  95%      1
  98%      3
  99%      5
 100%    201 (longest request)
This is ApacheBench, Version 2.3 <$Revision: 655654 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        
Server Hostname:        localhost
Server Port:            8888

Document Path:          /qa/t001.txt
Document Length:        131601 bytes

Concurrency Level:      1
Time taken for tests:   2.467 seconds
Complete requests:      5000
Failed requests:        0
Write errors:           0
Keep-Alive requests:    5000
Total transferred:      658665000 bytes
HTML transferred:       658005000 bytes
Requests per second:    2026.49 [#/sec] (mean)
Time per request:       0.493 [ms] (mean)
Time per request:       0.493 [ms] (mean, across all concurrent requests)
Transfer rate:          260698.55 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.0      0       0
Processing:     0    0   1.8      0      42
Waiting:        0    0   0.4      0      11
Total:          0    0   1.8      0      42

Percentage of the requests served within a certain time (ms)
  50%      0
  66%      0
  75%      0
  80%      0
  90%      0
  95%      1
  98%      2
  99%      3
 100%     42 (longest request)
This is ApacheBench, Version 2.3 <$Revision: 655654 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        
Server Hostname:        localhost
Server Port:            8888

Document Path:          /qa/t001.txt
Document Length:        131601 bytes

Concurrency Level:      100
Time taken for tests:   2.051 seconds
Complete requests:      5000
Failed requests:        0
Write errors:           0
Total transferred:      658545000 bytes
HTML transferred:       658005000 bytes
Requests per second:    2437.34 [#/sec] (mean)
Time per request:       41.028 [ms] (mean)
Time per request:       0.410 [ms] (mean, across all concurrent requests)
Transfer rate:          313495.52 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    4   6.5      1      46
Processing:     6   37  20.7     34     129
Waiting:        1   19  18.9     14     127
Total:          8   41  23.1     38     145

Percentage of the requests served within a certain time (ms)
  50%     38
  66%     43
  75%     49
  80%     53
  90%     69
  95%     89
  98%    111
  99%    126
 100%    145 (longest request)
This is ApacheBench, Version 2.3 <$Revision: 655654 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        
Server Hostname:        localhost
Server Port:            8888

Document Path:          /qa/t001.txt
Document Length:        131601 bytes

Concurrency Level:      100
Time taken for tests:   1.168 seconds
Complete requests:      5000
Failed requests:        0
Write errors:           0
Keep-Alive requests:    5000
Total transferred:      658665000 bytes
HTML transferred:       658005000 bytes
Requests per second:    4281.22 [#/sec] (mean)
Time per request:       23.358 [ms] (mean)
Time per request:       0.234 [ms] (mean, across all concurrent requests)
Transfer rate:          550759.44 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.7      0       8
Processing:     3   23  10.8     22      74
Waiting:        0   14  10.3     13      65
Total:          3   23  10.9     22      74

Percentage of the requests served within a certain time (ms)
  50%     22
  66%     26
  75%     29
  80%     31
  90%     37
  95%     42
  98%     54
  99%     57
 100%     74 (longest request)
This is ApacheBench, Version 2.3 <$Revision: 655654 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)...INFO: POST header == 
---
GET /qa/t010 HTTP/1.0
Host: localhost:8888
User-Agent: ApacheBench/2.3
Accept: */*


---
LOG: header received:
HTTP/1.1 200
Set-Cookie: i=aaaa-131127-091328.144-cfc8551e;path=/;expires=Thu, 31-Dec-2020 00:00:00 GMT;
Content-Type: text/html;charset=utf-8
Transfer-Encoding: chunked


LOG: Response code = 200
..done


Server Software:        
Server Hostname:        localhost
Server Port:            8888

Document Path:          /qa/t010
Document Length:        104 bytes

Concurrency Level:      1
Time taken for tests:   0.006 seconds
Complete requests:      1
Failed requests:        0
Write errors:           0
Total transferred:      280 bytes
HTML transferred:       104 bytes
Requests per second:    158.63 [#/sec] (mean)
Time per request:       6.304 [ms] (mean)
Time per request:       6.304 [ms] (mean, across all concurrent requests)
Transfer rate:          43.38 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.0      0       0
Processing:     6    6   0.0      6       6
Waiting:        5    5   0.0      5       5
Total:          6    6   0.0      6       6
This is ApacheBench, Version 2.3 <$Revision: 655654 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)...INFO: POST header == 
---
GET /qa/t013 HTTP/1.0
Connection: Keep-Alive
Host: localhost:8888
User-Agent: ApacheBench/2.3
Accept: */*


---
LOG: header received:
HTTP/1.1 200
Set-Cookie: i=aaaa-131127-091328.159-566413b8;path=/;expires=Thu, 31-Dec-2020 00:00:00 GMT;
Connection: Keep-Alive
Content-Type: text/html;charset=utf-8
Transfer-Encoding: chunked


LOG: Response code = 200
..done


Server Software:        
Server Hostname:        localhost
Server Port:            8888

Document Path:          /qa/t013
Document Length:        0 bytes

Concurrency Level:      1
Time taken for tests:   0.005 seconds
Complete requests:      1
Failed requests:        0
Write errors:           0
Keep-Alive requests:    1
Total transferred:      200 bytes
HTML transferred:       0 bytes
Requests per second:    202.76 [#/sec] (mean)
Time per request:       4.932 [ms] (mean)
Time per request:       4.932 [ms] (mean, across all concurrent requests)
Transfer rate:          39.60 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.0      0       0
Processing:     5    5   0.0      5       5
Waiting:        4    4   0.0      4       4
Total:          5    5   0.0      5       5
This is ApacheBench, Version 2.3 <$Revision: 655654 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        
Server Hostname:        localhost
Server Port:            8888

Document Path:          /qa/t010
Document Length:        104 bytes

Concurrency Level:      100
Time taken for tests:   2.430 seconds
Complete requests:      5000
Failed requests:        0
Write errors:           0
Total transferred:      1400000 bytes
HTML transferred:       520000 bytes
Requests per second:    2057.82 [#/sec] (mean)
Time per request:       48.595 [ms] (mean)
Time per request:       0.486 [ms] (mean, across all concurrent requests)
Transfer rate:          562.69 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    6   9.6      2      47
Processing:     3   42  18.5     41     116
Waiting:        2   38  19.3     37     107
Total:          9   48  18.0     47     116

Percentage of the requests served within a certain time (ms)
  50%     47
  66%     54
  75%     61
  80%     64
  90%     72
  95%     80
  98%     88
  99%     94
 100%    116 (longest request)
This is ApacheBench, Version 2.3 <$Revision: 655654 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        
Server Hostname:        localhost
Server Port:            8888

Document Path:          /qa/t013
Document Length:        131724 bytes

Concurrency Level:      100
Time taken for tests:   14.063 seconds
Complete requests:      5000
Failed requests:        0
Write errors:           0
Total transferred:      659500000 bytes
HTML transferred:       658620000 bytes
Requests per second:    355.53 [#/sec] (mean)
Time per request:       281.268 [ms] (mean)
Time per request:       2.813 [ms] (mean, across all concurrent requests)
Transfer rate:          45795.69 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0   14  28.2      3     192
Processing:     8  264 104.8    261     565
Waiting:        1  141  75.9    137     334
Total:         20  279 102.7    273     565

Percentage of the requests served within a certain time (ms)
  50%    273
  66%    315
  75%    347
  80%    368
  90%    416
  95%    456
  98%    500
  99%    527
 100%    565 (longest request)